constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    outlet
    {
        type            patch;
        nFaces          110;
        startFace       42020;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          170;
        startFace       42130;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          170;
        startFace       42300;
    }
    inlet
    {
        type            patch;
        nFaces          110;
        startFace       42470;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       42580;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          21200;
        startFace       42780;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          21200;
        startFace       63980;
    }
)

// ************************************************************************* //
